#+TITLE: Org mode
#+AUTHOR: GTrunSec
#+EMAIL: gtrunsec@hardenedlinux.org
#+DATE: 2020-11-28 Sat
#+SETUPFILE: ../hugo.setup
#+SETUPFILE: ../theme-readtheorg.setup
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t


- tags :: [[file:emacs.org][Emacs]], [[file:../GuangTao-owner/GuangTao-profile.org][GuangTao's Profile]]

- [[https://code.orgmode.org/bzg/org-mode][bzg/org-mode: Org mode is for keeping notes, maintaining TODO lists, planning projects, and authoring documents with a fast and effective plain-text system. - Gogs]]


** org mode elisp parsing
#+begin_src emacs-lisp :tangle yes
(nconc
 '(("month" "day" "clockin" "clockout" "duration" "status" "title"))
 '(hline)
 (let ((ast (org-element-parse-buffer 'element)))
   (org-element-map ast 'clock
     (lambda (x)
       (let ((val (org-element-property :value x)))
     `(,(calendar-month-name (org-element-property :month-start val) t)
       ,(number-to-string (org-element-property :day-start val))
       ,(concat (number-to-string (org-element-property :hour-start val))
            ":"
            (format "%02d" (org-element-property :minute-start val)))
       ,(concat (number-to-string (org-element-property :hour-end val))
            ":"
            (format "%02d" (org-element-property :minute-end val)))
       ,(org-element-property :duration x)
       ,(org-element-property :status x)
       ,@(org-element-map
         (org-element-property :parent (org-element-property :parent x))
         'headline
           (lambda (x) (org-element-property :title x)))))))))
#+end_src

#+RESULTS:
| month | day | clockin | clockout | duration | status | title                      |
|-------+-----+---------+----------+----------+--------+----------------------------|
| Nov   |  14 |   16:19 |    17:59 |     1:40 | closed |                            |
| Nov   |  28 |   11:00 |    12:30 |     1:30 | closed |                            |
| Nov   |  19 |    0:14 |     1:43 |     1:29 | closed |                            |
| Nov   |  10 |   14:49 |    16:07 |     1:18 | closed |                            |
| Nov   |  28 |   19:35 |    21:39 |     2:04 | closed |                            |
| Nov   |  28 |   13:39 |    16:21 |     2:42 | closed |                            |
| Nov   |  19 |   20:45 |    22:21 |     1:36 | closed |                            |
| Nov   |  29 |   14:42 |    16:22 |     1:40 | closed |                            |
| Nov   |   5 |   23:39 |     1:21 |     1:42 | closed | 解析网易云音乐，生产图表化 |

